app/controllers/plants_controller.rb

    def index
        render json: Plant.all
---
SELECT "plants".* FROM "plants"

    def show
        render json: Plant.find(params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        plant = Plant.new(plant_params)

        if plant.save
---
INSERT INTO "plants" ("plant_name", "description", "image", "pet_name") VALUES ($1, $2, $3, $4) RETURNING "id"

    def update
        plant = Plant.find(params[:id])
        plant.update(plant_params)
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "plants" SET "image" = $1 WHERE "plants"."id" = $2  [["image", "https://www.altums.com/wp-content/uploads/2019/09/altums-Calathea-2.jpg"], ["id", 7]]

    def destroy
        plant =Plant.destroy(params[:id])
---
DELETE FROM "plants" WHERE "plants"."id" = $1  [["id", 2]]